grevaillot/svd_tools/headers/STM32F7x7/rtc.h
#pragma once 

/* --- RTC: Real-time clock ----------------------------------------- */

/** @defgroup rtc_registers Real-time clock Register
@{*/

/** RTC_TR time register **/
#define RTC_TR			MMIO32(RTC_BASE + 0x00)
/** RTC_DR date register **/
#define RTC_DR			MMIO32(RTC_BASE + 0x04)
/** RTC_CR control register **/
#define RTC_CR			MMIO32(RTC_BASE + 0x08)
/** RTC_ISR initialization and status register **/
#define RTC_ISR			MMIO32(RTC_BASE + 0x0c)
/** RTC_PRER prescaler register **/
#define RTC_PRER			MMIO32(RTC_BASE + 0x10)
/** RTC_WUTR wakeup timer register **/
#define RTC_WUTR			MMIO32(RTC_BASE + 0x14)
/** RTC_ALRMAR alarm A register **/
#define RTC_ALRMAR			MMIO32(RTC_BASE + 0x1c)
/** RTC_ALRMBR alarm B register **/
#define RTC_ALRMBR			MMIO32(RTC_BASE + 0x20)
/** RTC_WPR write protection register **/
#define RTC_WPR			MMIO32(RTC_BASE + 0x24)
/** RTC_SSR sub second register **/
#define RTC_SSR			MMIO32(RTC_BASE + 0x28)
/** RTC_SHIFTR shift control register **/
#define RTC_SHIFTR			MMIO32(RTC_BASE + 0x2c)
/** RTC_TSTR time stamp time register **/
#define RTC_TSTR			MMIO32(RTC_BASE + 0x30)
/** RTC_TSDR time stamp date register **/
#define RTC_TSDR			MMIO32(RTC_BASE + 0x34)
/** RTC_TSSSR timestamp sub second register **/
#define RTC_TSSSR			MMIO32(RTC_BASE + 0x38)
/** RTC_CALR calibration register **/
#define RTC_CALR			MMIO32(RTC_BASE + 0x3c)
/** RTC_TAMPCR tamper configuration register **/
#define RTC_TAMPCR			MMIO32(RTC_BASE + 0x40)
/** RTC_ALRMASSR alarm A sub second register **/
#define RTC_ALRMASSR			MMIO32(RTC_BASE + 0x44)
/** RTC_ALRMBSSR alarm B sub second register **/
#define RTC_ALRMBSSR			MMIO32(RTC_BASE + 0x48)
/** RTC_OR option register **/
#define RTC_OR			MMIO32(RTC_BASE + 0x4c)
/** RTC_BKP0R backup register **/
#define RTC_BKP0R			MMIO32(RTC_BASE + 0x50)
/** RTC_BKP1R backup register **/
#define RTC_BKP1R			MMIO32(RTC_BASE + 0x54)
/** RTC_BKP2R backup register **/
#define RTC_BKP2R			MMIO32(RTC_BASE + 0x58)
/** RTC_BKP3R backup register **/
#define RTC_BKP3R			MMIO32(RTC_BASE + 0x5c)
/** RTC_BKP4R backup register **/
#define RTC_BKP4R			MMIO32(RTC_BASE + 0x60)
/** RTC_BKP5R backup register **/
#define RTC_BKP5R			MMIO32(RTC_BASE + 0x64)
/** RTC_BKP6R backup register **/
#define RTC_BKP6R			MMIO32(RTC_BASE + 0x68)
/** RTC_BKP7R backup register **/
#define RTC_BKP7R			MMIO32(RTC_BASE + 0x6c)
/** RTC_BKP8R backup register **/
#define RTC_BKP8R			MMIO32(RTC_BASE + 0x70)
/** RTC_BKP9R backup register **/
#define RTC_BKP9R			MMIO32(RTC_BASE + 0x74)
/** RTC_BKP10R backup register **/
#define RTC_BKP10R			MMIO32(RTC_BASE + 0x78)
/** RTC_BKP11R backup register **/
#define RTC_BKP11R			MMIO32(RTC_BASE + 0x7c)
/** RTC_BKP12R backup register **/
#define RTC_BKP12R			MMIO32(RTC_BASE + 0x80)
/** RTC_BKP13R backup register **/
#define RTC_BKP13R			MMIO32(RTC_BASE + 0x84)
/** RTC_BKP14R backup register **/
#define RTC_BKP14R			MMIO32(RTC_BASE + 0x88)
/** RTC_BKP15R backup register **/
#define RTC_BKP15R			MMIO32(RTC_BASE + 0x8c)
/** RTC_BKP16R backup register **/
#define RTC_BKP16R			MMIO32(RTC_BASE + 0x90)
/** RTC_BKP17R backup register **/
#define RTC_BKP17R			MMIO32(RTC_BASE + 0x94)
/** RTC_BKP18R backup register **/
#define RTC_BKP18R			MMIO32(RTC_BASE + 0x98)
/** RTC_BKP19R backup register **/
#define RTC_BKP19R			MMIO32(RTC_BASE + 0x9c)
/** RTC_BKP20R backup register **/
#define RTC_BKP20R			MMIO32(RTC_BASE + 0xa0)
/** RTC_BKP21R backup register **/
#define RTC_BKP21R			MMIO32(RTC_BASE + 0xa4)
/** RTC_BKP22R backup register **/
#define RTC_BKP22R			MMIO32(RTC_BASE + 0xa8)
/** RTC_BKP23R backup register **/
#define RTC_BKP23R			MMIO32(RTC_BASE + 0xac)
/** RTC_BKP24R backup register **/
#define RTC_BKP24R			MMIO32(RTC_BASE + 0xb0)
/** RTC_BKP25R backup register **/
#define RTC_BKP25R			MMIO32(RTC_BASE + 0xb4)
/** RTC_BKP26R backup register **/
#define RTC_BKP26R			MMIO32(RTC_BASE + 0xb8)
/** RTC_BKP27R backup register **/
#define RTC_BKP27R			MMIO32(RTC_BASE + 0xbc)
/** RTC_BKP28R backup register **/
#define RTC_BKP28R			MMIO32(RTC_BASE + 0xc0)
/** RTC_BKP29R backup register **/
#define RTC_BKP29R			MMIO32(RTC_BASE + 0xc4)
/** RTC_BKP30R backup register **/
#define RTC_BKP30R			MMIO32(RTC_BASE + 0xc8)
/** RTC_BKP31R backup register **/
#define RTC_BKP31R			MMIO32(RTC_BASE + 0xcc)

/**@}*/


/** @defgroup rtc_tr TR time register
@{*/

/** RTC_TR_PM AM/PM notation **/
#define RTC_TR_PM		(1 << 22)

#define RTC_TR_HT_SHIFT		20
#define RTC_TR_HT_MASK		0x03
/** @defgroup rtc_tr_ht HT Hour tens in BCD format
@{*/
/**@}*/


#define RTC_TR_HU_SHIFT		16
#define RTC_TR_HU_MASK		0x0f
/** @defgroup rtc_tr_hu HU Hour units in BCD format
@{*/
/**@}*/


#define RTC_TR_MNT_SHIFT		12
#define RTC_TR_MNT_MASK		0x07
/** @defgroup rtc_tr_mnt MNT Minute tens in BCD format
@{*/
/**@}*/


#define RTC_TR_MNU_SHIFT		8
#define RTC_TR_MNU_MASK		0x0f
/** @defgroup rtc_tr_mnu MNU Minute units in BCD format
@{*/
/**@}*/


#define RTC_TR_ST_SHIFT		4
#define RTC_TR_ST_MASK		0x07
/** @defgroup rtc_tr_st ST Second tens in BCD format
@{*/
/**@}*/


#define RTC_TR_SU_SHIFT		0
#define RTC_TR_SU_MASK		0x0f
/** @defgroup rtc_tr_su SU Second units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_dr DR date register
@{*/


#define RTC_DR_YT_SHIFT		20
#define RTC_DR_YT_MASK		0x0f
/** @defgroup rtc_dr_yt YT Year tens in BCD format
@{*/
/**@}*/


#define RTC_DR_YU_SHIFT		16
#define RTC_DR_YU_MASK		0x0f
/** @defgroup rtc_dr_yu YU Year units in BCD format
@{*/
/**@}*/


#define RTC_DR_WDU_SHIFT		13
#define RTC_DR_WDU_MASK		0x07
/** @defgroup rtc_dr_wdu WDU Week day units
@{*/
/**@}*/

/** RTC_DR_MT Month tens in BCD format **/
#define RTC_DR_MT		(1 << 12)

#define RTC_DR_MU_SHIFT		8
#define RTC_DR_MU_MASK		0x0f
/** @defgroup rtc_dr_mu MU Month units in BCD format
@{*/
/**@}*/


#define RTC_DR_DT_SHIFT		4
#define RTC_DR_DT_MASK		0x03
/** @defgroup rtc_dr_dt DT Date tens in BCD format
@{*/
/**@}*/


#define RTC_DR_DU_SHIFT		0
#define RTC_DR_DU_MASK		0x0f
/** @defgroup rtc_dr_du DU Date units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_cr CR control register
@{*/

